```Terraform will perform the following actions:

  # turbot_policy_setting.accountPasswordPolicySettings will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettings" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettings"
      + value                        = "Check: Configured"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsMaxAge will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsMaxAge" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsMaxAge"
      + value                        = "90"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsMinimumLength will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsMinimumLength" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsMinimumLength"
      + value                        = "14"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsRequireLowercaseCharacters will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsRequireLowercaseCharacters" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireLowercaseCharacters"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsRequireNumbers will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsRequireNumbers" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireNumbers"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsRequireSymbols will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsRequireSymbols" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireSymbols"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsRequireUppercaseCharacters will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsRequireUppercaseCharacters" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireUppercaseCharacters"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.accountPasswordPolicySettingsReusePrevention will be created
  + resource "turbot_policy_setting" "accountPasswordPolicySettingsReusePrevention" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsReusePrevention"
      + value                        = "24"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_group_policy_attachement_approved will be created
  + resource "turbot_policy_setting" "aws_iam_group_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupPolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_group_policy_attachement_rules will be created
  + resource "turbot_policy_setting" "aws_iam_group_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupPolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_role_policy_attachement_approved will be created
  + resource "turbot_policy_setting" "aws_iam_role_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_role_policy_attachement_rules will be created
  + resource "turbot_policy_setting" "aws_iam_role_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_user_policy_attachement_approved will be created
  + resource "turbot_policy_setting" "aws_iam_user_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userPolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_user_policy_attachement_rules will be created
  + resource "turbot_policy_setting" "aws_iam_user_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userPolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_group_inline_policy_approved will be created
  + resource "turbot_policy_setting" "iam_group_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_group_inline_policy_approved_admin_access will be created
  + resource "turbot_policy_setting" "iam_group_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_policy_approved will be created
  + resource "turbot_policy_setting" "iam_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/iamPolicyApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_policy_approved_statements will be created
  + resource "turbot_policy_setting" "iam_policy_approved_statements" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- set anyStar = r/\*/g -%}
            {%- set goodStar = r/(Get|List)\*/g -%}
            {%- set approved = true -%}
            {%- for statement in $.policy.statements -%}
                {%- for action in statement.Action -%}
                    {%- if anyStar.test(action) -%}
                        {%- if not goodStar.test(action) -%}
                            {%- set approved = false -%}
                        {%- endif -%}
                    {%- endif -%}
                {%- endfor -%}
            {%- endfor -%}
            {%- if approved  -%}
                "Approved"
            {%- else -%}
                "Not approved"
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
                policy: resource {
                    statements: get(path: "PolicyVersion.Statement")
                }
            }
        EOT
      + type                         = "tmod:@turbot/aws-iam#/policy/types/iamPolicyApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_inline_policy_approved will be created
  + resource "turbot_policy_setting" "iam_role_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/roleInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_inline_policy_approved_admin_access will be created
  + resource "turbot_policy_setting" "iam_role_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/roleInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_policy_trusted_access will be created
  + resource "turbot_policy_setting" "iam_role_policy_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyTrustedAccess"
      + value                        = "Check: Trusted Access"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_access_key_active will be created
  + resource "turbot_policy_setting" "iam_user_access_key_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accessKeyActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_access_key_active_age will be created
  + resource "turbot_policy_setting" "iam_user_access_key_active_age" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accessKeyActiveAge"
      + value                        = "Force inactive if age > 90 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_inline_policy_approved will be created
  + resource "turbot_policy_setting" "iam_user_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_inline_policy_approved_admin_access will be created
  + resource "turbot_policy_setting" "iam_user_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_mfa_approved will be created
  + resource "turbot_policy_setting" "iam_user_mfa_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_mfa_approved_usage will be created
  + resource "turbot_policy_setting" "iam_user_mfa_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- set matches = false -%}
            {%- for v in $.resources.items -%}
            	{%- if v.usertest == $.user.UserName -%}
            	{%- set matches = true -%}
            	{%- endif -%}
            {%- endfor -%}
            {%- if matches -%}
            "Approved"
            {%- else -%}
            "Not approved"
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
            	user{
            		Arn
            		UserName
            		}
            resources(filter:"resourceType:'tmod:@turbot/aws-iam#/resource/types/mfaVirtual'") {
            	items {
            		usertest: get(path:"User.UserName")
            		trunk {
            			title
            			}
            		}
            	}
            }
        EOT
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_iam will be created
  + resource "turbot_smart_folder" "aws_iam" {
      + description = "Defines sets of policies for the AWS check S3 baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check IAM Policies"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + smart_folder_description     = "Defines sets of policies for the AWS check S3 baseline"
  + smart_folder_name            = "AWS Check IAM Policies"
  + smart_folder_parent_resource = "tmod:@turbot/turbot#/"
  + turbot_profile               = "default"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_iam: Creating...
turbot_smart_folder.aws_iam: Creation complete after 2s [id=215542849345539]
turbot_policy_setting.iam_role_inline_policy_approved_admin_access: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_rules: Creating...
turbot_policy_setting.aws_iam_role_policy_attachement_rules: Creating...
turbot_policy_setting.accountPasswordPolicySettings: Creating...
turbot_policy_setting.iam_user_inline_policy_approved_admin_access: Creating...
turbot_policy_setting.iam_user_access_key_active_age: Creating...
turbot_policy_setting.iam_user_mfa_approved: Creating...
turbot_policy_setting.iam_role_inline_policy_approved: Creating...
turbot_policy_setting.iam_group_inline_policy_approved: Creating...
turbot_policy_setting.accountPasswordPolicySettingsRequireLowercaseCharacters: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_rules: Creation complete after 3s [id=215542853094412]
turbot_policy_setting.aws_iam_role_policy_attachement_approved: Creating...
turbot_policy_setting.iam_user_access_key_active_age: Creation complete after 4s [id=215542853096461]
turbot_policy_setting.iam_role_inline_policy_approved: Creation complete after 4s [id=215542853097486]
turbot_policy_setting.accountPasswordPolicySettingsRequireUppercaseCharacters: Creating...
turbot_policy_setting.aws_iam_user_policy_attachement_approved: Creating...
turbot_policy_setting.iam_user_inline_policy_approved_admin_access: Creation complete after 4s [id=215542853681179]
turbot_policy_setting.aws_iam_user_policy_attachement_rules: Creating...
turbot_policy_setting.iam_user_mfa_approved: Creation complete after 5s [id=215542854393909]
turbot_policy_setting.accountPasswordPolicySettingsRequireLowercaseCharacters: Creation complete after 5s [id=215542854360102]
turbot_policy_setting.accountPasswordPolicySettings: Creation complete after 5s [id=215542854364199]
turbot_policy_setting.iam_role_inline_policy_approved_admin_access: Creation complete after 5s [id=215542854448186]
turbot_policy_setting.accountPasswordPolicySettingsRequireSymbols: Creating...
turbot_policy_setting.iam_group_inline_policy_approved: Creation complete after 5s [id=215542854389810]
turbot_policy_setting.aws_iam_role_policy_attachement_rules: Creation complete after 5s [id=215542854366249]
turbot_policy_setting.iam_user_inline_policy_approved: Creating...
turbot_policy_setting.iam_role_policy_trusted_access: Creating...
turbot_policy_setting.accountPasswordPolicySettingsMaxAge: Creating...
turbot_policy_setting.iam_group_inline_policy_approved_admin_access: Creating...
turbot_policy_setting.iam_user_mfa_approved_usage: Creating...
turbot_policy_setting.aws_iam_role_policy_attachement_approved: Creation complete after 3s [id=215542855015487]
turbot_policy_setting.accountPasswordPolicySettingsMinimumLength: Creating...
turbot_policy_setting.aws_iam_user_policy_attachement_rules: Creation complete after 3s [id=215542856214598]
turbot_policy_setting.accountPasswordPolicySettingsRequireUppercaseCharacters: Creation complete after 3s [id=215542856233035]
turbot_policy_setting.accountPasswordPolicySettingsReusePrevention: Creating...
turbot_policy_setting.iam_user_access_key_active: Creating...
turbot_policy_setting.aws_iam_user_policy_attachement_approved: Creation complete after 3s [id=215542856232010]
turbot_policy_setting.iam_policy_approved_statements: Creating...
turbot_policy_setting.iam_user_inline_policy_approved: Creation complete after 3s [id=215542857250904]
turbot_policy_setting.iam_user_mfa_approved_usage: Creation complete after 3s [id=215542857244757]
turbot_policy_setting.iam_role_policy_trusted_access: Creation complete after 3s [id=215542857391202]
turbot_policy_setting.accountPasswordPolicySettingsRequireNumbers: Creating...
turbot_policy_setting.iam_policy_approved: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_approved: Creating...
turbot_policy_setting.accountPasswordPolicySettingsRequireSymbols: Creation complete after 3s [id=215542857253980]
turbot_policy_setting.accountPasswordPolicySettingsMaxAge: Creation complete after 3s [id=215542858311784]
turbot_policy_setting.iam_group_inline_policy_approved_admin_access: Creation complete after 4s [id=215542858330220]
turbot_policy_setting.iam_policy_approved_statements: Creation complete after 2s [id=215542858966129]
turbot_policy_setting.iam_user_access_key_active: Creation complete after 2s [id=215542859158650]
turbot_policy_setting.accountPasswordPolicySettingsMinimumLength: Creation complete after 3s [id=215542859155575]
turbot_policy_setting.aws_iam_group_policy_attachement_approved: Creation complete after 2s [id=215542859802754]
turbot_policy_setting.accountPasswordPolicySettingsRequireNumbers: Creation complete after 2s [id=215542859808901]
turbot_policy_setting.accountPasswordPolicySettingsReusePrevention: Creation complete after 3s [id=215542859881611]
turbot_policy_setting.iam_policy_approved: Creation complete after 2s [id=215542859894927]

Apply complete! Resources: 28 added, 0 changed, 0 destroyed.

Outputs:

smart_folder_description = "Defines sets of policies for the AWS check S3 baseline"
smart_folder_name = "AWS Check IAM Policies"
smart_folder_parent_resource = "tmod:@turbot/turbot#/"
turbot_profile = "default"
```